# MSc Thesis - Hugo Stam

### Example 02 - Offshore Port System - Barges

<img src="Figures/system_layout_alternative_2B.png" style="width:1000px">

In [1]:
# packages for data handling
import numpy as np
import pandas as pd
import statistics as st

# packages for figures
import matplotlib.pyplot as plt
import matplotlib as mpl
from matplotlib.ticker import FormatStrFormatter
# %matplotlib inline
%matplotlib notebook

import seaborn as sns
sns.set(style="ticks")
# sns.set_style("whitegrid")
# sns.set(style="darkgrid", palette = "pastel")
# sns.set_context("notebook", font_scale=1.2, rc={"lines.linewidth": 1.5})

import matplotlib.pyplot as plt
from mpl_toolkits.mplot3d import Axes3D

from pandas.plotting import register_matplotlib_converters
register_matplotlib_converters()

# OpenTISim package
from opentisim import container_objects
from opentisim import container_defaults
from opentisim import container_system_offshore_barge

# OpenCLSim package
import openclsim.core as core
import openclsim.model as model
import openclsim.plot as plot

# Additional import to save the initialisation of the simulation
import openclsim.savesim as savesim

# Pretty-print a Python object to a stream
from pprint import pprint

# Jupyter Widgets
import ipywidgets as widgets
from IPython.display import HTML

# Scroll to specific cell
from jupyter_helpers.utilities import scroll_to_current_cell

# no warnings
import warnings
warnings.filterwarnings('ignore')

In [2]:
# iPython Widgests
life_cycle = widgets.IntSlider(value=20, min=10, max=30, step=5, description='Life cycle:')
annual_demand = widgets.IntSlider(value=1000000, min=500000, max=1500000, step=50000, description='Demand:')
offshore_onshore_distance = widgets.IntSlider(value=40, min=20, max=60, step=20, description='Distance:')

container_ship = widgets.Dropdown(options=[('Post Panamax I (6,000 TEU)', 6000),
                                           ('New-Panamax (12,500 TEU)', 12500),
                                           ('ULCS (21,000 TEU)', 21000)], 
                                  value=12500, description='OGV:')

barge = widgets.Dropdown(options=[('Small (200 TEU)', 200), 
                                  ('Medium (250 TEU)', 250),
                                  ('Large (300 TEU)', 300)], 
                         value=250, description='Barge:')

foreshore_slope = widgets.Dropdown(options=[('Gently (3 km/m)', 3.0), 
                                            ('Average (2 km/m)', 2.0),
                                            ('Steep (1 km/m)', 1.0)], 
                                   value=2.0, description='Slope:')

print('\033[1m*** Input Values \033[0m')
display(annual_demand, offshore_onshore_distance, container_ship, barge, 
        foreshore_slope, life_cycle)

*** Input Values

IntSlider(value=1000000, description='Demand:', max=1500000, min=500000, step=50000)

IntSlider(value=40, description='Distance:', max=60, min=20, step=20)

Dropdown(description='OGV:', index=1, options=(('Post Panamax I (6,000 TEU)', 6000), ('New-Panamax (12,500 TEU…

Dropdown(description='Barge:', index=1, options=(('Small (200 TEU)', 200), ('Medium (250 TEU)', 250), ('Large …

Dropdown(description='Slope:', index=1, options=(('Gently (3 km/m)', 3.0), ('Average (2 km/m)', 2.0), ('Steep …

IntSlider(value=20, description='Life cycle:', max=30, min=10, step=5)

In [3]:
scroll_to_current_cell(preserve=True)

In [4]:
offshore_distance = offshore_onshore_distance.value
demand = annual_demand.value
design_container_ship = container_ship.value
design_barge = barge.value
slope = foreshore_slope.value
lifecycle = life_cycle.value

print('The offshore distance:', offshore_distance, 'km')
print('The annual demand:', demand, 'TEU')
print('The design container ship capacity:', design_container_ship, 'TEU')
print('The design barge capacity:', design_barge, 'TEU')
print('The slope of the foreshore:', slope, 'in km reach per meter water depth')
print('The design life cycle:', lifecycle, 'years')

avg_parcel = design_container_ship / 8

startyear = 2020

The offshore distance: 40 km
The annual demand: 1000000 TEU
The design container ship capacity: 12500 TEU
The design barge capacity: 250 TEU
The slope of the foreshore: 2.0 in km reach per meter water depth
The design life cycle: 20 years

In [5]:
container = demand  # TEU
years = list(range(startyear, startyear+lifecycle+1))

trend_1 = []
trend_2 = []
trend_3 = []

for i in range(lifecycle-4):
    trend_1.append(container +   500_000/15 * i)
    trend_2.append(container + 1_000_000/15 * i)
    trend_3.append(container + 1_500_000/15 * i)

demand_0 = []
demand_1 = []
demand_2 = []
demand_3 = []

for year in years:
    if year < 2025:
        demand_0.append(int(container * 1.00))
        demand_1.append(int(container * 1.00))
        demand_2.append(int(container * 1.00))
        demand_3.append(int(container * 1.00))
        
    elif year < 2030:
        demand_0.append(int(container * 1.00))
        demand_1.append(int(container * 1.17))
        demand_2.append(int(container * 1.33))
        demand_3.append(int(container * 1.50))
    elif year < 2035:
        demand_0.append(int(container * 1.00))
        demand_1.append(int(container * 1.33))
        demand_2.append(int(container * 1.67))
        demand_3.append(int(container * 2.00))
    else:
        demand_0.append(int(container * 1.00))
        demand_1.append(int(container * 1.50))
        demand_2.append(int(container * 2.00))
        demand_3.append(int(container * 2.50))

# # figure 
# plt.figure(figsize=(10,6))

# plt.plot(years[5:lifecycle+1], trend_1, color='tab:green', linestyle='--', zorder=0)
# plt.plot(years[5:lifecycle+1], trend_2, color='tab:blue' , linestyle='--', zorder=0)
# plt.plot(years[5:lifecycle+1], trend_3, color='tab:cyan' , linestyle='--', zorder=0)

# plt.step(years, demand_0, color='tab:olive', linewidth=3, label='base', where='post', zorder=4)
# plt.step(years, demand_1, color='tab:green', linewidth=3, label='scenario 1', where='post', zorder=3)
# plt.step(years, demand_2, color='tab:blue' , linewidth=3, label='scenario 2', where='post', zorder=2)
# plt.step(years, demand_3, color='tab:cyan' , linewidth=3, label='scenario 3', where='post', zorder=1)
    
# plt.xlabel("Date (years)", fontsize='large')

# if lifecycle == 20:
#     plt.xticks([2020, 2025, 2030, 2035, 2040])

# plt.yticks([0, 0.5e6, 1e6, 1.5e6, 2e6, 2.5e6, 3e6],
#            [0, '500,000', '1,000,000', '1,500,000', '2,000,000', '2,500,000', '3,000,000'])
# plt.ylabel('Demand [TEU]', fontsize='large')

# plt.legend(loc='best', title='Growth scenarios', title_fontsize='large', fontsize='large', frameon=False)

# # figure aesthetics
# plt.grid(False, which='major')
# sns.despine(top=True)

# # save fig
# if lifecycle == 20 and demand == 1_000_000:
#     plt.savefig("SaveFigures/growth_scenarios.png")

In [6]:
if lifecycle == 20:
    years = years[0:20]
    demand_0 = demand_0[0:20]
    demand_1 = demand_1[0:20]
    demand_2 = demand_2[0:20]
    demand_3 = demand_3[0:20]
    
if lifecycle == 10:
    years = years[0:10]
    demand_0 = demand_0[0:10]
    demand_1 = demand_1[0:10]
    demand_2 = demand_2[0:10]
    demand_3 = demand_3[0:10]

In [16]:
years = list(range(startyear, startyear + lifecycle))
       
scenario_demand = demand_0
scenario_data={'year': years, 'volume': scenario_demand}
# print(scenario_data)

# instantiate Commodity objects, the inputs for the Commodity class
if design_container_ship == 6000:
    container_defaults.container_data['post_panamax_I_perc'] = 100
    container_defaults.container_data['new_panamax_perc'] = 0
    container_defaults.container_data['ULCS_perc'] = 0

if design_container_ship == 12500:
    container_defaults.container_data['post_panamax_I_perc'] = 0
    container_defaults.container_data['new_panamax_perc'] = 100
    container_defaults.container_data['ULCS_perc'] = 0
    
if design_container_ship == 21000:
    container_defaults.container_data['post_panamax_I_perc'] = 0
    container_defaults.container_data['new_panamax_perc'] = 0
    container_defaults.container_data['ULCS_perc'] = 100
    
# print(container_defaults.container_data)

# ladens
container = container_objects.Commodity(**container_defaults.container_data)
container.scenario_data = pd.DataFrame(data=scenario_data)
# print(container)
# print(container.scenario_data)

# combine
demand = [container]

In [8]:
# instantiate vessels
fully_cellular = container_objects.Vessel(**container_defaults.fully_cellular_data)
panamax = container_objects.Vessel(**container_defaults.panamax_data)
panamax_max = container_objects.Vessel(**container_defaults.panamax_max_data)
post_panamax_I = container_objects.Vessel(**container_defaults.post_panamax_I_data)
post_panamax_II = container_objects.Vessel(**container_defaults.post_panamax_II_data)
new_panamax = container_objects.Vessel(**container_defaults.new_panamax_data)
VLCS = container_objects.Vessel(**container_defaults.VLCS_data)
ULCS = container_objects.Vessel(**container_defaults.ULCS_data)

vessels = [fully_cellular, panamax, panamax_max, post_panamax_I, post_panamax_II, new_panamax, VLCS, ULCS]

In [17]:
OffshoreBarge = container_system_offshore_barge.System(
                startyear = startyear,
                lifecycle = lifecycle,
                stack_equipment = 'rmg',
                laden_stack = 'rmg',
                elements = demand + vessels,
                crane_type_defaults = container_defaults.sts_crane_data,
                offshore_distance = offshore_distance,
                barge_type = 'medium',
                foreshore_slope = slope,
                bathymetry_factor = 0.80,
                allowable_berth_occupancy = 0.70,
                laden_perc=0.80, 
                reefer_perc=0.10,
                empty_perc=0.075, 
                oog_perc=0.025,
                transhipment_ratio = 0.0,
                debug = True)

# Start simulation

In [18]:
# scroll_to_current_cell(preserve=True)
OffshoreBarge.simulate()

*** nr of OGV berths: 1
     >> max vessel length: 366
     >> quay length 396 m
     >> quay depth 19 m

   Year  Offshore Capex  Offshore Insurance
0  2020      27760383.6                0.00
1  2021      18506922.4                0.00
2  2022             0.0           405250.56
3  2023             0.0           405250.56
4  2024             0.0           405250.56

   Year  Offshore Capex  Offshore Insurance  Offshore Labour
0  2020             0.0                 0.0              0.0
1  2021      11500000.0                 0.0              0.0
2  2022             0.0            100000.0         687500.0
3  2023             0.0            100000.0         687500.0
4  2024             0.0            100000.0         687500.0

*** nr of OGV berths: 1

   Year  Offshore Capex  Offshore Insurance  Offshore Labour
0  2020             0.0                 0.0              0.0
1  2021      11500000.0                 0.0              0.0
2  2022             0.0            100000.0         687500.0
3  2023             0.0            100000.0         687500.0
4  2024             0.0            100000.0         687500.0

*** nr of OGV berths: 1

   Year  Offshore Capex  Offshore Insurance  Offshore Labour
0  2020             0.0                 0.0              0.0
1  2021      11500000.0                 0.0              0.0
2  2022             0.0            100000.0         687500.0
3  2023             0.0            100000.0         687500.0
4  2024             0.0            100000.0         687500.0

*** nr of OGV berths: 2
     >> max vessel length: 366
     >> quay length 853 m
     >> quay depth 19 m

   Year  Offshore Capex  Offshore Insurance
0  2020      58079190.0               0.000
1  2021      38719460.0               0.000
2  2022             0.0          873130.752
3  2023             0.0          873130.752
4  2024             0.0          873130.752

   Year  Offshore Capex  Offshore Insurance  Offshore Labour
0  2020             0.0                 0.0              0.0
1  2021      11500000.0                 0.0              0.0
2  2022             0.0            100000.0         687500.0
3  2023             0.0            100000.0         687500.0
4  2024             0.0            100000.0         687500.0

*** nr of OGV berths: 2

   Year  Offshore Capex  Offshore Insurance  Offshore Labour
0  2020             0.0                 0.0              0.0
1  2021      11500000.0                 0.0              0.0
2  2022             0.0            100000.0         687500.0
3  2023             0.0            100000.0         687500.0
4  2024             0.0            100000.0         687500.0

*** nr of OGV berths: 2

   Year  Offshore Capex  Offshore Insurance  Offshore Labour
0  2020             0.0                 0.0              0.0
1  2021      11500000.0                 0.0              0.0
2  2022             0.0            100000.0         687500.0
3  2023             0.0            100000.0         687500.0
4  2024             0.0            100000.0         687500.0

*** nr of OGV berths: 3
     >> max vessel length: 366
     >> quay length 1,272 m
     >> quay depth 19 m

   Year  Offshore Capex  Offshore Insurance
0  2020      85933854.0               0.000
1  2021      57289236.0               0.000
2  2022             0.0         1302020.928
3  2023             0.0         1302020.928
4  2024             0.0         1302020.928

   Year  Offshore Capex  Offshore Insurance  Offshore Labour
0  2020             0.0                 0.0              0.0
1  2021      11500000.0                 0.0              0.0
2  2022             0.0            100000.0         687500.0
3  2023             0.0            100000.0         687500.0
4  2024             0.0            100000.0         687500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Capex
0  2020             0.0
1  2021       3700358.0
2  2022             0.0
3  2023             0.0
4  2024             0.0

   Year  Offshore Capex
0  2020             0.0
1  2021       3700358.0
2  2022             0.0
3  2023             0.0
4  2024             0.0

   Year  Offshore Capex
0  2020             0.0
1  2021       3700358.0
2  2022             0.0
3  2023             0.0
4  2024             0.0

   Year  Offshore Capex
0  2020             0.0
1  2021       3700358.0
2  2022             0.0
3  2023             0.0
4  2024             0.0

   Year  Offshore Capex
0  2020             0.0
1  2021       3700358.0
2  2022             0.0
3  2023             0.0
4  2024             0.0

   Year  Offshore Capex
0  2020             0.0
1  2021       3700358.0
2  2022             0.0
3  2023             0.0
4  2024             0.0

   Year  Offshore Capex
0  2020             0.0
1  2021       3700358.0
2  2022             0.0
3  2023             0.0
4  2024             0.0

   Year  Offshore Capex
0  2020             0.0
1  2021       3700358.0
2  2022             0.0
3  2023             0.0
4  2024             0.0

   Year  Offshore Capex
0  2020             0.0
1  2021        759400.0
2  2022             0.0
3  2023             0.0
4  2024             0.0

   Year  Offshore Capex
0  2020             0.0
1  2021        759400.0
2  2022             0.0
3  2023             0.0
4  2024             0.0

   Year  Offshore Capex
0  2020             0.0
1  2021       1705000.0
2  2022             0.0
3  2023             0.0
4  2024             0.0

   Year  Offshore Capex
0  2020             0.0
1  2021       1705000.0
2  2022             0.0
3  2023             0.0
4  2024             0.0

     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  0 TEU

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

   Year  Offshore Labour  Onshore Labour
0  2020              0.0             0.0
1  2021              0.0             0.0
2  2022         125000.0        187500.0
3  2023         125000.0        187500.0
4  2024         125000.0        187500.0

*** nr of offshore barge berths: 1
*** nr of offshore barge quays:  0
offshore_barge_quay_length 130 m
offshore_barge_quay_depth  9 m

   Year  Offshore Capex  Offshore Insurance
0  2020       4609044.0                 0.0
1  2021       3072696.0                 0.0
2  2022             0.0             61942.4
3  2023             0.0             61942.4
4  2024             0.0             61942.4

*** nr of offshore barge cranes: 0

   Year  Offshore Capex  Offshore Insurance  Offshore Labour
0  2020       5750000.0                 0.0              0.0
1  2021             0.0             50000.0         187500.0
2  2022             0.0             50000.0         187500.0
3  2023             0.0             50000.0         187500.0
4  2024             0.0             50000.0         187500.0

*** nr of offshore barge cranes: 1
*** nr of offshore barge berths: 2
*** nr of offshore barge quays:  1
offshore_barge_quay_length 268 m
offshore_barge_quay_depth  9 m

   Year  Offshore Capex  Offshore Insurance
0  2020       8864798.4                0.00
1  2021       5909865.6                0.00
2  2022             0.0           127696.64
3  2023             0.0           127696.64
4  2024             0.0           127696.64

*** nr of offshore barge cranes: 1

   Year  Offshore Capex  Offshore Insurance  Offshore Labour
0  2020       5750000.0                 0.0              0.0
1  2021             0.0             50000.0         187500.0
2  2022             0.0             50000.0         187500.0
3  2023             0.0             50000.0         187500.0
4  2024             0.0             50000.0         187500.0

*** nr of offshore barge cranes: 2
*** nr of offshore barge berths: 3
*** nr of offshore barge quays:  2
offshore_barge_quay_length 394 m
offshore_barge_quay_depth  9 m

   Year  Offshore Capex  Offshore Insurance
0  2020      12765906.6                0.00
1  2021       8510604.4                0.00
2  2022             0.0           187971.36
3  2023             0.0           187971.36
4  2024             0.0           187971.36

*** nr of offshore barge cranes: 2

   Year  Offshore Capex  Offshore Insurance  Offshore Labour
0  2020       5750000.0                 0.0              0.0
1  2021             0.0             50000.0         187500.0
2  2022             0.0             50000.0         187500.0
3  2023             0.0             50000.0         187500.0
4  2024             0.0             50000.0         187500.0

*** nr of offshore barge cranes: 3
*** nr of offshore barge berths: 4
*** nr of offshore barge quays:  3
offshore_barge_quay_length 521 m
offshore_barge_quay_depth  9 m

   Year  Offshore Capex  Offshore Insurance
0  2020      16667014.8                0.00
1  2021      11111343.2                0.00
2  2022             0.0           248246.08
3  2023             0.0           248246.08
4  2024             0.0           248246.08

*** nr of offshore barge cranes: 3

   Year  Offshore Capex  Offshore Insurance  Offshore Labour
0  2020       5750000.0                 0.0              0.0
1  2021             0.0             50000.0         187500.0
2  2022             0.0             50000.0         187500.0
3  2023             0.0             50000.0         187500.0
4  2024             0.0             50000.0         187500.0

*** nr of offshore barge cranes: 4
*** nr of offshore barge berths: 5
*** nr of offshore barge quays:  4
offshore_barge_quay_length 647 m
offshore_barge_quay_depth  9 m

   Year  Offshore Capex  Offshore Insurance
0  2020      20568123.0                 0.0
1  2021      13712082.0                 0.0
2  2022             0.0            308520.8
3  2023             0.0            308520.8
4  2024             0.0            308520.8

*** nr of offshore barge cranes: 4

   Year  Offshore Capex  Offshore Insurance  Offshore Labour
0  2020       5750000.0                 0.0              0.0
1  2021             0.0             50000.0         187500.0
2  2022             0.0             50000.0         187500.0
3  2023             0.0             50000.0         187500.0
4  2024             0.0             50000.0         187500.0

*** nr of offshore barge cranes: 5
*** nr of offshore barge berths: 6
*** nr of offshore barge quays:  5
offshore_barge_quay_length 774 m
offshore_barge_quay_depth  9 m

   Year  Offshore Capex  Offshore Insurance
0  2020      24469231.2                0.00
1  2021      16312820.8                0.00
2  2022             0.0           368795.52
3  2023             0.0           368795.52
4  2024             0.0           368795.52

*** nr of offshore barge cranes: 5

   Year  Offshore Capex  Offshore Insurance  Offshore Labour
0  2020       5750000.0                 0.0              0.0
1  2021             0.0             50000.0         187500.0
2  2022             0.0             50000.0         187500.0
3  2023             0.0             50000.0         187500.0
4  2024             0.0             50000.0         187500.0

*** nr of offshore barge cranes: 6
check offshore_land_use 36.653490600000005 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
channel_width 480 m
channel_depth 18 m
channel_length 0 m
channel_volume 0 m3
turning_circle_diameter 658 m3
turning_circle_volume 0 m3
berth_pocket_width 98 m
berth_pocket_volume 0 m3
dredging_volume 0 m3

channel_length_max 36,400 m
excavation_depth 0 m

   Year
0  2020
1  2021
2  2022
3  2023
4  2024

check offshore_land_use 36.653490600000005 ha
     >> draught vessel 15.2 m
     >> natural depth 20.0 m
     >> water depth 20.0 m

     >> reclamation_area 367,000 m2
     >> reclamation_volume 7,331,000 m3

   Year  Reclamation  Coastal Structures Maintenance
0  2020  161265413.0                            0.00
1  2021          0.0                       696316.86
2  2022          0.0                       696316.86
3  2023          0.0                       696316.86
4  2024          0.0                       696316.86

check offshore_land_use 36.653490600000005 ha
check offshore_land_use 36.653490600000005 ha

     >> revetment_length 610 m

   Year  Coastal Protection  Coastal Structures Maintenance
0  2020         108975827.0                             0.0
1  2021                 0.0                       1089758.0
2  2022                 0.0                       1089758.0
3  2023                 0.0                       1089758.0
4  2024                 0.0                       1089758.0

check offshore_land_use 36.653490600000005 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 0
nr barges required: 14
barge opex 519383 USD

   Year  Barge Operations  Barge Labour
0  2020          0.000000           0.0
1  2021     294383.016364      225000.0
2  2022     294383.016364      225000.0
3  2023     294383.016364      225000.0
4  2024     294383.016364      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 1
nr barges required: 14
barge opex 719383 USD

   Year  Barge Capex  Barge Operations  Barge Maintenance  Barge Labour
0  2020          0.0          0.000000                0.0           0.0
1  2021    4000000.0     294383.016364           200000.0      225000.0
2  2022    4000000.0     294383.016364           200000.0      225000.0
3  2023    4000000.0     294383.016364           200000.0      225000.0
4  2024    4000000.0     294383.016364           200000.0      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 2
nr barges required: 14
barge opex 919383 USD

   Year  Barge Capex  Barge Operations  Barge Maintenance  Barge Labour
0  2020          0.0          0.000000                0.0           0.0
1  2021    8000000.0     294383.016364           400000.0      225000.0
2  2022    8000000.0     294383.016364           400000.0      225000.0
3  2023    8000000.0     294383.016364           400000.0      225000.0
4  2024    8000000.0     294383.016364           400000.0      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 3
nr barges required: 14
barge opex 1119383 USD

   Year  Barge Capex  Barge Operations  Barge Maintenance  Barge Labour
0  2020          0.0          0.000000                0.0           0.0
1  2021   12000000.0     294383.016364           600000.0      225000.0
2  2022   12000000.0     294383.016364           600000.0      225000.0
3  2023   12000000.0     294383.016364           600000.0      225000.0
4  2024   12000000.0     294383.016364           600000.0      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 4
nr barges required: 14
barge opex 1319383 USD

   Year  Barge Capex  Barge Operations  Barge Maintenance  Barge Labour
0  2020          0.0          0.000000                0.0           0.0
1  2021   16000000.0     294383.016364           800000.0      225000.0
2  2022   16000000.0     294383.016364           800000.0      225000.0
3  2023   16000000.0     294383.016364           800000.0      225000.0
4  2024   16000000.0     294383.016364           800000.0      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 5
nr barges required: 14
barge opex 1519383 USD

   Year  Barge Capex  Barge Operations  Barge Maintenance  Barge Labour
0  2020          0.0          0.000000                0.0           0.0
1  2021   20000000.0     294383.016364          1000000.0      225000.0
2  2022   20000000.0     294383.016364          1000000.0      225000.0
3  2023   20000000.0     294383.016364          1000000.0      225000.0
4  2024   20000000.0     294383.016364          1000000.0      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 6
nr barges required: 14
barge opex 1719383 USD

   Year  Barge Capex  Barge Operations  Barge Maintenance  Barge Labour
0  2020          0.0          0.000000                0.0           0.0
1  2021   24000000.0     294383.016364          1200000.0      225000.0
2  2022   24000000.0     294383.016364          1200000.0      225000.0
3  2023   24000000.0     294383.016364          1200000.0      225000.0
4  2024   24000000.0     294383.016364          1200000.0      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 7
nr barges required: 14
barge opex 1919383 USD

   Year  Barge Capex  Barge Operations  Barge Maintenance  Barge Labour
0  2020          0.0          0.000000                0.0           0.0
1  2021   28000000.0     294383.016364          1400000.0      225000.0
2  2022   28000000.0     294383.016364          1400000.0      225000.0
3  2023   28000000.0     294383.016364          1400000.0      225000.0
4  2024   28000000.0     294383.016364          1400000.0      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 8
nr barges required: 14
barge opex 2119383 USD

   Year  Barge Capex  Barge Operations  Barge Maintenance  Barge Labour
0  2020          0.0          0.000000                0.0           0.0
1  2021   32000000.0     294383.016364          1600000.0      225000.0
2  2022   32000000.0     294383.016364          1600000.0      225000.0
3  2023   32000000.0     294383.016364          1600000.0      225000.0
4  2024   32000000.0     294383.016364          1600000.0      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 9
nr barges required: 14
barge opex 2319383 USD

   Year  Barge Capex  Barge Operations  Barge Maintenance  Barge Labour
0  2020          0.0          0.000000                0.0           0.0
1  2021   36000000.0     294383.016364          1800000.0      225000.0
2  2022   36000000.0     294383.016364          1800000.0      225000.0
3  2023   36000000.0     294383.016364          1800000.0      225000.0
4  2024   36000000.0     294383.016364          1800000.0      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 10
nr barges required: 14
barge opex 2519383 USD

   Year  Barge Capex  Barge Operations  Barge Maintenance  Barge Labour
0  2020          0.0          0.000000                0.0           0.0
1  2021   40000000.0     294383.016364          2000000.0      225000.0
2  2022   40000000.0     294383.016364          2000000.0      225000.0
3  2023   40000000.0     294383.016364          2000000.0      225000.0
4  2024   40000000.0     294383.016364          2000000.0      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 11
nr barges required: 14
barge opex 2719383 USD

   Year  Barge Capex  Barge Operations  Barge Maintenance  Barge Labour
0  2020          0.0          0.000000                0.0           0.0
1  2021   44000000.0     294383.016364          2200000.0      225000.0
2  2022   44000000.0     294383.016364          2200000.0      225000.0
3  2023   44000000.0     294383.016364          2200000.0      225000.0
4  2024   44000000.0     294383.016364          2200000.0      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 12
nr barges required: 14
barge opex 2919383 USD

   Year  Barge Capex  Barge Operations  Barge Maintenance  Barge Labour
0  2020          0.0          0.000000                0.0           0.0
1  2021   48000000.0     294383.016364          2400000.0      225000.0
2  2022   48000000.0     294383.016364          2400000.0      225000.0
3  2023   48000000.0     294383.016364          2400000.0      225000.0
4  2024   48000000.0     294383.016364          2400000.0      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 13
nr barges required: 14
barge opex 3119383 USD

   Year  Barge Capex  Barge Operations  Barge Maintenance  Barge Labour
0  2020          0.0          0.000000                0.0           0.0
1  2021   52000000.0     294383.016364          2600000.0      225000.0
2  2022   52000000.0     294383.016364          2600000.0      225000.0
3  2023   52000000.0     294383.016364          2600000.0      225000.0
4  2024   52000000.0     294383.016364          2600000.0      225000.0

handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14

Calibration Barge Channel
barge_channel_width 127 m
barge_channel_depth 10 m
barge_channel_length 21,000 m
barge_channel_volume 14,045,850 m3
barge_turning_circle_diameter 180 m
barge_turning_circle_volume 267,192 m3
barge_berth_pocket_width 26 m
barge_berth_pocket_volume 387,933 m3
barge_dredging_volume 14,700,975 m3

   Year  Capital Dredging  Maintenance Dredging
0  2020        91881096.5          0.000000e+00
1  2021        91881096.5          0.000000e+00
2  2022               0.0          6.615439e+06
3  2023               0.0          6.615439e+06
4  2024               0.0          6.615439e+06

*** nr of onshore barge berths: 1
*** nr of onshore barge quays: 0
onshore_barge_quay_length 130 m
onshore_barge_quay_depth 9 m

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance
0  2020      4609044.0                  0.0                0.0
1  2021      3072696.0                  0.0                0.0
2  2022            0.0              61942.4            61942.4
3  2023            0.0              61942.4            61942.4
4  2024            0.0              61942.4            61942.4

*** nr of onshore barge cranes: 0

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance  Onshore Labour
0  2020            0.0                  0.0                0.0             0.0
1  2021      5750000.0                  0.0                0.0             0.0
2  2022            0.0             100000.0            50000.0        187500.0
3  2023            0.0             100000.0            50000.0        187500.0
4  2024            0.0             100000.0            50000.0        187500.0

*** nr of onshore barge cranes: 1
*** nr of onshore barge berths: 2
*** nr of onshore barge quays: 1
onshore_barge_quay_length 268 m
onshore_barge_quay_depth 9 m

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance
0  2020      8864798.4                 0.00               0.00
1  2021      5909865.6                 0.00               0.00
2  2022            0.0            127696.64          127696.64
3  2023            0.0            127696.64          127696.64
4  2024            0.0            127696.64          127696.64

*** nr of onshore barge cranes: 1

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance  Onshore Labour
0  2020            0.0                  0.0                0.0             0.0
1  2021      5750000.0                  0.0                0.0             0.0
2  2022            0.0             100000.0            50000.0        187500.0
3  2023            0.0             100000.0            50000.0        187500.0
4  2024            0.0             100000.0            50000.0        187500.0

*** nr of onshore barge cranes: 2
*** nr of onshore barge berths: 3
*** nr of onshore barge quays: 2
onshore_barge_quay_length 394 m
onshore_barge_quay_depth 9 m

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance
0  2020     12765906.6                 0.00               0.00
1  2021      8510604.4                 0.00               0.00
2  2022            0.0            187971.36          187971.36
3  2023            0.0            187971.36          187971.36
4  2024            0.0            187971.36          187971.36

*** nr of onshore barge cranes: 2

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance  Onshore Labour
0  2020            0.0                  0.0                0.0             0.0
1  2021      5750000.0                  0.0                0.0             0.0
2  2022            0.0             100000.0            50000.0        187500.0
3  2023            0.0             100000.0            50000.0        187500.0
4  2024            0.0             100000.0            50000.0        187500.0

*** nr of onshore barge cranes: 3
*** nr of onshore barge berths: 4
*** nr of onshore barge quays: 3
onshore_barge_quay_length 521 m
onshore_barge_quay_depth 9 m

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance
0  2020     16667014.8                 0.00               0.00
1  2021     11111343.2                 0.00               0.00
2  2022            0.0            248246.08          248246.08
3  2023            0.0            248246.08          248246.08
4  2024            0.0            248246.08          248246.08

*** nr of onshore barge cranes: 3

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance  Onshore Labour
0  2020            0.0                  0.0                0.0             0.0
1  2021      5750000.0                  0.0                0.0             0.0
2  2022            0.0             100000.0            50000.0        187500.0
3  2023            0.0             100000.0            50000.0        187500.0
4  2024            0.0             100000.0            50000.0        187500.0

*** nr of onshore barge cranes: 4
*** nr of onshore barge berths: 5
*** nr of onshore barge quays: 4
onshore_barge_quay_length 647 m
onshore_barge_quay_depth 9 m

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance
0  2020     20568123.0                  0.0                0.0
1  2021     13712082.0                  0.0                0.0
2  2022            0.0             308520.8           308520.8
3  2023            0.0             308520.8           308520.8
4  2024            0.0             308520.8           308520.8

*** nr of onshore barge cranes: 4

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance  Onshore Labour
0  2020            0.0                  0.0                0.0             0.0
1  2021      5750000.0                  0.0                0.0             0.0
2  2022            0.0             100000.0            50000.0        187500.0
3  2023            0.0             100000.0            50000.0        187500.0
4  2024            0.0             100000.0            50000.0        187500.0

*** nr of onshore barge cranes: 5

   Year  Onshore Capex  Onshore Labour
0  2020            0.0             0.0
1  2021       107187.0             0.0
2  2022            0.0        250000.0
3  2023            0.0        250000.0
4  2024            0.0        250000.0

   Year  Onshore Capex  Onshore Labour
0  2020            0.0             0.0
1  2021       107187.0             0.0
2  2022            0.0        250000.0
3  2023            0.0        250000.0
4  2024            0.0        250000.0

   Year  Onshore Capex  Onshore Labour
0  2020            0.0             0.0
1  2021       107187.0             0.0
2  2022            0.0        250000.0
3  2023            0.0        250000.0
4  2024            0.0        250000.0

   Year  Onshore Capex  Onshore Labour
0  2020            0.0             0.0
1  2021       107187.0             0.0
2  2022            0.0        250000.0
3  2023            0.0        250000.0
4  2024            0.0        250000.0

   Year  Onshore Capex  Onshore Labour
0  2020            0.0             0.0
1  2021       107187.0             0.0
2  2022            0.0        250000.0
3  2023            0.0        250000.0
4  2024            0.0        250000.0

*** nr of hinterland barge berths: 1
*** nr of hinterland barge quays: 0
hinterland barge quay length 130 m
hinterland barge quay depth 9 m

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance
0  2020      4609044.0                  0.0                0.0
1  2021      3072696.0                  0.0                0.0
2  2022            0.0              61942.4            61942.4
3  2023            0.0              61942.4            61942.4
4  2024            0.0              61942.4            61942.4

*** nr of hinterland barge cranes: 0

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance  Onshore Labour
0  2020            0.0                  0.0                0.0             0.0
1  2021      5750000.0                  0.0                0.0             0.0
2  2022            0.0             100000.0            50000.0        187500.0
3  2023            0.0             100000.0            50000.0        187500.0
4  2024            0.0             100000.0            50000.0        187500.0

*** nr of onshore barge cranes: 1
*** nr of hinterland barge berths: 2
*** nr of hinterland barge quays: 1
hinterland barge quay length 268 m
hinterland barge quay depth 9 m

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance
0  2020      8864798.4                 0.00               0.00
1  2021      5909865.6                 0.00               0.00
2  2022            0.0            127696.64          127696.64
3  2023            0.0            127696.64          127696.64
4  2024            0.0            127696.64          127696.64

*** nr of hinterland barge cranes: 1

   Year  Onshore Capex  Onshore Maintenance  Onshore Insurance  Onshore Labour
0  2020            0.0                  0.0                0.0             0.0
1  2021      5750000.0                  0.0                0.0             0.0
2  2022            0.0             100000.0            50000.0        187500.0
3  2023            0.0             100000.0            50000.0        187500.0
4  2024            0.0             100000.0            50000.0        187500.0

*** nr of onshore barge cranes: 2
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  0 TEU

check offshore_land_use 36.653490600000005 ha

   Year  Offshore Capex
0  2020    3.423534e+07
1  2021    0.000000e+00
2  2022    0.000000e+00
3  2023    0.000000e+00
4  2024    0.000000e+00

length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
     >> draught vessel 15.2 m
     >> natural depth 20.0 m
     >> water depth 20.0 m

     >> reclamation_area 8,000 m2
     >> reclamation_volume 152,000 m3

   Year  Reclamation  Coastal Structures Maintenance
0  2020          0.0                             0.0
1  2021   21280800.0                             0.0
2  2022          0.0                        193808.0
3  2023          0.0                        193808.0
4  2024          0.0                        193808.0

check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha

     >> revetment_length 10 m

   Year  Coastal Protection  Coastal Structures Maintenance
0  2020                 0.0                             0.0
1  2021           1123995.0                             0.0
2  2022                 0.0                         11239.0
3  2023                 0.0                         11239.0
4  2024                 0.0                         11239.0

check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

,Year,Offshore Capex,Offshore Maintenance,Onshore Capex,Onshore Maintenance
0,2020,0.0,0.0,0.0,0.0
1,2021,2505000.0,0.0,3757500.0,0.0
2,2022,0.0,250000.0,0.0,375000.0
3,2023,0.0,250000.0,0.0,375000.0
4,2024,0.0,250000.0,0.0,375000.0

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14
     Total Ground Slots required   (@ start of year):  1,990
     Total Stack capacity required (@ start of year):  10,200 TEU
     Total Stack capacity online   (@ start of year):  10,800 TEU

check offshore_land_use 37.4134906 ha
length 366
draught 15.2
beam 49.0
quay_length 1272
check offshore_land_use 37.4134906 ha
check offshore_land_use 37.4134906 ha
handling rate: 21.1 TEU/hr
barge capacity 250
sum of loading and unloading time: 26.0 hrs
sailing time: 3.0 hrs
total cycle time: 58.0 hrs or 2.4 days
annual cycles per barge: 110
annual barge capacity: 55097 TEU
nr barges online: 14
nr barges required: 14

check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha
   > The factor is 0
   > The waiting time occupancy is nan
   > The factor is 0
   > The waiting time occupancy is nan
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
   > The factor is 0.09158231529655952
   > The waiting time occupancy is 0.040884962185964074
throughput 1000000
vessel.year_online 2020
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020       60000000.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

throughput 1000000
vessel.year_online 2021
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021       60000000.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

throughput 1000000
vessel.year_online 2022
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022       60000000.0
3  2023       60000000.0
4  2024       60000000.0

throughput 1000000
vessel.year_online 2023
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023       60000000.0
4  2024       60000000.0

throughput 1000000
vessel.year_online 2024
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024       60000000.0

throughput 1000000
vessel.year_online 2025
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2026
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2027
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2028
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2029
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2030
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2031
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2032
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2033
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2034
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2035
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2036
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2037
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2038
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

throughput 1000000
vessel.year_online 2039
container_ship_costs 60,000,000 USD

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

   Year  Ocean Transport
0  2020              0.0
1  2021              0.0
2  2022              0.0
3  2023              0.0
4  2024              0.0

check offshore_land_use 37.4134906 ha
check onshore_land_use 19.914040600000003 ha

    Years         Capex          Opex            PV        cum-PV
0    2020  7.675239e+08  0.000000e+00  7.675239e+08  7.675239e+08
1    2021  5.608752e+08  3.016259e+07  5.910378e+08  1.358562e+09
2    2022  0.000000e+00  1.406622e+08  1.406622e+08  1.499224e+09
3    2023  0.000000e+00  1.296121e+08  1.296121e+08  1.628836e+09
4    2024  0.000000e+00  1.193644e+08  1.193644e+08  1.748200e+09
5    2025  0.000000e+00  1.098636e+08  1.098636e+08  1.858064e+09
6    2026  0.000000e+00  1.010578e+08  1.010578e+08  1.959122e+09
7    2027  0.000000e+00  9.289863e+07  9.289863e+07  2.052020e+09
8    2028  0.000000e+00  8.534108e+07  8.534108e+07  2.137361e+09
9    2029  0.000000e+00  7.834304e+07  7.834304e+07  2.215704e+09
10   2030  0.000000e+00  7.186531e+07  7.186531e+07  2.287570e+09
11   2031  0.000000e+00  6.587131e+07  6.587131e+07  2.353441e+09
12   2032  0.000000e+00  6.032695e+07  6.032695e+07  2.413768e+09
13   2033  0.000000e+00  5.520047e+07  5.520047e+07  2.468969e+09
14   2034  0.000000e+00  5.046224e+07  5.046224e+07  2.519431e+09
15   2035  0.000000e+00  4.608468e+07  4.608468e+07  2.565515e+09
16   2036  0.000000e+00  4.204206e+07  4.204206e+07  2.607557e+09
17   2037  0.000000e+00  3.831044e+07  3.831044e+07  2.645868e+09
18   2038  0.000000e+00  3.486750e+07  3.486750e+07  2.680735e+09
19   2039  0.000000e+00  3.169247e+07  3.169247e+07  2.712428e+09

In [19]:
demand = annual_demand.value

cash_flows_df, cash_flows_WACC_real_df = OffshoreBarge.add_cashflow_elements()
PV, PV_df = OffshoreBarge.net_present_value(False)

if lifecycle == 20 and scenario_demand == demand_0:
    if demand == 1000000:
        if offshore_distance == 20:  
            if design_container_ship == 6000:
                PV_alt2_20_6000_1000000 = PV
                %store PV_alt2_20_6000_1000000

            if design_container_ship == 12500:
                PV_alt2_20_12500_1000000 = PV
                %store PV_alt2_20_12500_1000000

            if design_container_ship == 21000:
                PV_alt2_20_21000_1000000 = PV
                %store PV_alt2_20_21000_1000000

        if offshore_distance == 40:  
            if design_container_ship == 6000:
                PV_alt2_40_6000_1000000 = PV
                %store PV_alt2_40_6000_1000000

            if design_container_ship == 12500:
                PV_alt2_40_12500_1000000 = PV
                %store PV_alt2_40_12500_1000000

            if design_container_ship == 21000:
                PV_alt2_40_21000_1000000 = PV
                %store PV_alt2_40_21000_1000000

        if offshore_distance == 60:  
            if design_container_ship == 6000:
                PV_alt2_60_6000_1000000 = PV
                %store PV_alt2_60_6000_1000000

            if design_container_ship == 12500:
                PV_alt2_60_12500_1000000 = PV
                %store PV_alt2_60_12500_1000000

            if design_container_ship == 21000:
                PV_alt2_60_21000_1000000 = PV
                %store PV_alt2_60_21000_1000000

Stored 'PV_alt2_40_12500_1000000' (float64)

In [20]:
# demand
if lifecycle == 20 and scenario_demand == demand_0 and offshore_distance == 40 and design_container_ship == 12500:
    if demand == 500_000:
        PV_alt2_40_12500_500000 = PV
        %store PV_alt2_40_12500_500000
    if demand == 1_000_000:
        PV_alt2_40_12500_1000000 = PV
        %store PV_alt2_40_12500_1000000
    if demand == 1_500_000:
        PV_alt2_40_12500_1500000 = PV
        %store PV_alt2_40_12500_1500000

Stored 'PV_alt2_40_12500_1000000' (float64)

In [21]:
# growing demand
if lifecycle == 20 and offshore_distance == 40 and design_container_ship == 12500 and slope == 2.0:
    if scenario_demand == demand_0:
        PV_alt2_40_12500_1000000_growth0 = PV
        %store PV_alt2_40_12500_1000000_growth0
    if scenario_demand == demand_1:
        PV_alt2_40_12500_1000000_growth1 = PV
        %store PV_alt2_40_12500_1000000_growth1
    if scenario_demand == demand_2:
        PV_alt2_40_12500_1000000_growth2 = PV
        %store PV_alt2_40_12500_1000000_growth2
    if scenario_demand == demand_3:
        PV_alt2_40_12500_1000000_growth3 = PV
        %store PV_alt2_40_12500_1000000_growth3

Stored 'PV_alt2_40_12500_1000000_growth0' (float64)

In [22]:
# slope in km reach per meter water depth
if lifecycle == 20 and offshore_distance == 40 and design_container_ship == 12500 and scenario_demand == demand_0:
    if slope == 3.0:
        PV_alt2_40_12500_1000000_slope1 = PV
        %store PV_alt2_40_12500_1000000_slope1
    if slope == 2.0:
        PV_alt2_40_12500_1000000_slope2 = PV
        %store PV_alt2_40_12500_1000000_slope2
    if slope == 1.0:
        PV_alt2_40_12500_1000000_slope3 = PV
        %store PV_alt2_40_12500_1000000_slope3

Stored 'PV_alt2_40_12500_1000000_slope2' (float64)